jmeter-results/gateway-stress-20260605-145027/html-report/statistics.json
{
  "POST /auth/login" : {
    "transaction" : "POST /auth/login",
    "sampleCount" : 460,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 152.42391304347834,
    "medianResTime" : 141.0,
    "minResTime" : 118.0,
    "maxResTime" : 918.0,
    "pct1ResTime" : 179.90000000000003,
    "pct2ResTime" : 194.95,
    "pct3ResTime" : 332.0399999999995,
    "throughput" : 15.332822239258693,
    "receivedKBytesPerSec" : 8.744500183327222,
    "sentKBytesPerSec" : 3.923046315122829
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 2300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 40.85173913043481,
    "medianResTime" : 10.0,
    "minResTime" : 1.0,
    "maxResTime" : 918.0,
    "pct1ResTime" : 144.0,
    "pct2ResTime" : 165.0,
    "pct3ResTime" : 203.98999999999978,
    "throughput" : 73.46365146288488,
    "receivedKBytesPerSec" : 200.33193393062476,
    "sentKBytesPerSec" : 16.68715364283889
  },
  "GET /openapi.json" : {
    "transaction" : "GET /openapi.json",
    "sampleCount" : 460,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.760869565217389,
    "medianResTime" : 4.0,
    "minResTime" : 1.0,
    "maxResTime" : 185.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 15.0,
    "pct3ResTime" : 30.389999999999986,
    "throughput" : 15.401098165260478,
    "receivedKBytesPerSec" : 176.28542147950986,
    "sentKBytesPerSec" : 2.256020239051828
  },
  "GET /health" : {
    "transaction" : "GET /health",
    "sampleCount" : 460,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.123913043478264,
    "medianResTime" : 4.0,
    "minResTime" : 1.0,
    "maxResTime" : 185.0,
    "pct1ResTime" : 12.0,
    "pct2ResTime" : 22.0,
    "pct3ResTime" : 150.6999999999996,
    "throughput" : 15.378957574136605,
    "receivedKBytesPerSec" : 4.535591003309819,
    "sentKBytesPerSec" : 2.16266590886296
  },
  "GET /data/students" : {
    "transaction" : "GET /data/students",
    "sampleCount" : 460,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.706521739130405,
    "medianResTime" : 11.0,
    "minResTime" : 5.0,
    "maxResTime" : 296.0,
    "pct1ResTime" : 28.0,
    "pct2ResTime" : 44.94999999999999,
    "pct3ResTime" : 236.09999999999877,
    "throughput" : 15.846768637177897,
    "receivedKBytesPerSec" : 9.857804318244455,
    "sentKBytesPerSec" : 6.9329612787653305
  },
  "GET /logs/api/logs?limit=2" : {
    "transaction" : "GET /logs/api/logs?limit=2",
    "sampleCount" : 460,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.243478260869555,
    "medianResTime" : 12.0,
    "minResTime" : 6.0,
    "maxResTime" : 215.0,
    "pct1ResTime" : 29.900000000000034,
    "pct2ResTime" : 42.94999999999999,
    "pct3ResTime" : 194.39,
    "throughput" : 16.002783092711777,
    "receivedKBytesPerSec" : 11.220701426335014,
    "sentKBytesPerSec" : 2.4848071403722387
  }
}